# ConCssSwitchDimension

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**value** | **bool** |  | [optional]
**type** | **str** |  | [default to 'IdeaStatiCa.Api.Connection.Model.Material.ConCssSwitchDimension, IdeaStatiCa.Api']

## Example

```python
from ideastatica_connection_api.models.con_css_switch_dimension import ConCssSwitchDimension

# TODO update the JSON string below
json = "{}"
# create an instance of ConCssSwitchDimension from a JSON string
con_css_switch_dimension_instance = ConCssSwitchDimension.from_json(json)
# print the JSON string representation of the object
print(con_css_switch_dimension_instance.to_json())

# convert the object into a dict
con_css_switch_dimension_dict = con_css_switch_dimension_instance.to_dict()
# create an instance of ConCssSwitchDimension from a dict
con_css_switch_dimension_from_dict = ConCssSwitchDimension.from_dict(con_css_switch_dimension_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)